DataProcessors/ЛБ_НастройкаРазмеровДрагоценныхКамней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЛБ_НастройкаРазмеровДрагоценныхКамней</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДрагоценныеВставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКамня</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОгранки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ФормыОгранки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОгранки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ВидыОгранки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Размеры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_РазмерыДрагоценныхКамней</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидКамня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ФормыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_РазмерыДрагоценныхКамней</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЛБ_НастройкаРазмеровДрагоценныхКамней/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТаблицы();
КонецПроцедуры         

&НаСервере
Процедура ЗаполнитьТаблицы()
	Объект.ДрагоценныеВставки.Очистить();
	Объект.Размеры.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ВидКамня КАК ВидКамня,
	               |	ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ФормаОгранки КАК ФормаОгранки,
	               |	ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ВидОгранки КАК ВидОгранки,
	               |	ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.Размер КАК Размер
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней КАК ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаДВ = ТаблицаЗапроса.Скопировать();  
	ТаблицаДВ.Свернуть("ВидКамня, ФормаОгранки, ВидОгранки,");
	Ном = 0;
	Для каждого Стр из ТаблицаДВ Цикл 
		Ном = Ном + 1;
		НоваяСтр = Объект.ДрагоценныеВставки.Добавить();
		НоваяСтр.КлючСтроки = Ном;
		НоваяСтр.ВидКамня = Стр.ВидКамня; 
		НоваяСтр.ФормаОгранки = Стр.ФормаОгранки; 
		НоваяСтр.ВидОгранки = Стр.ВидОгранки;  
		
		Для Инд = 0 По Перечисления.ЛБ_РазмерыДрагоценныхКамней.Количество() - 1 цикл
			НоваяСтрР = Объект.Размеры.Добавить();
		    НоваяСтрР.КлючСтроки = Ном;
			НоваяСтрР.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Получить(Инд); 
			
			Отбор = Новый структура;
			Отбор.Вставить("ВидКамня", НоваяСтр.ВидКамня); 
			Отбор.Вставить("ФормаОгранки", НоваяСтр.ФормаОгранки);
			Отбор.Вставить("ВидОгранки", НоваяСтр.ВидОгранки);
			Отбор.Вставить("Размер", НоваяСтрР.Размер);
			
			Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда 
				НоваяСтрР.Используется = Истина;
			КонецЕсли;	
		Конеццикла;	
	КонецЦикла;	
КонецПроцедуры      

&НаКлиенте
Процедура ДобавитьСтроку(Команда)     
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеДобавленияСтроки",ЭтаФорма);
	ОткрытьФорму("Обработка.ЛБ_НастройкаРазмеровДрагоценныхКамней.Форма.ФормаДобавить",,ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры   

&НаСервере
Процедура ПослеДобавленияСтроки(Результат, Парамеры) Экспорт 
	Если Результат = неопределено тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ДрагоценныеВставки.Количество() = 0 тогда
		КлючСтроки = 1; 
	Иначе	
		ТаблицаДоп = Объект.ДрагоценныеВставки.Выгрузить(, "КлючСтроки");
		ТаблицаДоп.Сортировать("КлючСтроки Убыв");
		КлючСтроки = ТаблицаДоп.Получить(0).Ключстроки + 1; 
	КонецЕсли;	
	
	НоваяСтр = Объект.ДрагоценныеВставки.Добавить();
	НоваяСтр.КлючСтроки = КлючСтроки;
	НоваяСтр.ВидКамня = Результат.ВидКамня; 
	НоваяСтр.ФормаОгранки = Результат.ФормаОгранки; 
	НоваяСтр.ВидОгранки = Результат.ВидОгранки; 
	
	Для Инд = 0 По Перечисления.ЛБ_РазмерыДрагоценныхКамней.Количество() - 1 цикл
		НоваяСтрР = Объект.Размеры.Добавить();
	    НоваяСтрР.КлючСтроки = КлючСтроки;
		НоваяСтрР.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Получить(Инд);
	Конеццикла;	
    Элементы.ДрагоценныеВставки.ТекущаяСтрока = НоваяСтр.ПолучитьИдентификатор();
КонецПроцедуры	

&НаКлиенте
Процедура КопироватьСтроку(Команда)
	СтрокаТабличнойЧасти = Элементы.ДрагоценныеВставки.ТекущиеДанные;
	ПараметрыФормы = новый структура;
	ПараметрыФормы.Вставить("ВидКамня", СтрокаТабличнойЧасти.ВидКамня); 
	ПараметрыФормы.Вставить("ФормаОгранки", СтрокаТабличнойЧасти.ФормаОгранки);
	ПараметрыФормы.Вставить("ВидОгранки", СтрокаТабличнойЧасти.ВидОгранки);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеДобавленияСтроки",ЭтаФорма);
	ОткрытьФорму("Обработка.ЛБ_НастройкаРазмеровДрагоценныхКамней.Форма.ФормаДобавить", Параметрыформы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере(Идентификатор)
	Стр = Объект.ДрагоценныеВставки.НайтиПоИдентификатору(Идентификатор); 
	НаборЗаписей = РегистрыСведений.ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.СоздатьНаборЗаписей();  				
	НаборЗаписей.Отбор.ВидКамня.Установить(Стр.ВидКамня); 
	НаборЗаписей.Отбор.ФормаОгранки.Установить(Стр.ФормаОгранки);
	НаборЗаписей.Отбор.ВидОгранки.Установить(Стр.ВидОгранки);
    НаборЗаписей.Записать();  
	ЗаполнитьТаблицы();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)   
	СтрокаТабличнойЧасти = Элементы.ДрагоценныеВставки.ТекущиеДанные;  
	УдалитьНаСервере(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
КонецПроцедуры


&НаКлиенте
Процедура ДрагоценныеВставкиПриАктивизацииСтроки(Элемент)
	СтрокаТабличнойЧасти = Элементы.ДрагоценныеВставки.ТекущиеДанные;	
		
	Если СтрокаТабличнойЧасти <> неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", СтрокаТабличнойЧасти.КлючСтроки);
		Элементы.Размеры.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);		
		
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", 0);
		Элементы.Размеры.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазмерыИспользуетсяПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ДрагоценныеВставки.ТекущиеДанные; 
	СтрокаТабличнойЧастиРазмеры = Элементы.Размеры.ТекущиеДанные; 
	СохранитьНаСервере(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрокаТабличнойЧастиРазмеры.ПолучитьИдентификатор());
КонецПроцедуры 

&НаСервере
Процедура СохранитьНаСервере(Идентификатор, ИдентификаторРазмер) 
	Стр = Объект.ДрагоценныеВставки.НайтиПоИдентификатору(Идентификатор);
	СтрР = Объект.Размеры.НайтиПоИдентификатору(ИдентификаторРазмер);
	Если СтрР.Используется Тогда
	    НаборЗаписей = РегистрыСведений.ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.СоздатьНаборЗаписей();  				
		НаборЗаписей.Отбор.ВидКамня.Установить(Стр.ВидКамня); 
		НаборЗаписей.Отбор.ФормаОгранки.Установить(Стр.ФормаОгранки);
		НаборЗаписей.Отбор.ВидОгранки.Установить(Стр.ВидОгранки);
        НаборЗаписей.Отбор.Размер.Установить(СтрР.Размер);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить(); 
			НоваяЗапись.ВидКамня = Стр.ВидКамня; 
			НоваяЗапись.ФормаОгранки = Стр.ФормаОгранки;
			НоваяЗапись.ВидОгранки = Стр.ВидОгранки;
	        НоваяЗапись.Размер = СтрР.Размер;
		ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
			Запись = НаборЗаписей[0];
			Запись.Размер = СтрР.Размер;
		КонецЕсли;
		НаборЗаписей.Записать();
	Иначе 
		НаборЗаписей = РегистрыСведений.ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.СоздатьНаборЗаписей();  				
		НаборЗаписей.Отбор.ВидКамня.Установить(Стр.ВидКамня); 
		НаборЗаписей.Отбор.ФормаОгранки.Установить(Стр.ФормаОгранки);
		НаборЗаписей.Отбор.ВидОгранки.Установить(Стр.ВидОгранки);
        НаборЗаписей.Отбор.Размер.Установить(СтрР.Размер);
		НаборЗаписей.Записать();
	КонецЕсли;	
КонецПроцедуры
